# Напишите функцию draw_box(), которая выводит звездный прямоугольник с размерами 14 x 10 в соответствии с образцом:
def print_pram():
    for i in range(1,11):
         print('*' * i, end = '\n')

print_pram()