# На вход программе подается строка текста и строка разделитель.
# Напишите программу, которая вставляет указанный разделитель между каждым символом введенной строки текста.
s, razdelit = input(), input()
print((razdelit).join(s))